content-org/content.org
#+hugo_base_dir: ..
** Paredit Basics
:PROPERTIES:
:EXPORT_DATE: 2019-08-15T00:00:00-04:00
:EXPORT_FILE_NAME: paredit-basics
:EXPORT_HUGO_CODE_FENCE: t
:END:
The =|= character is where our cursor is for purposes of visualizing where to invoke these methods.
*** =paredit-wrap-round=
Let's wrap the =2= here.
#+BEGIN_SRC emacs-lisp
(+ 1 |2 3 4)
;; Keybinding M-(
(+ 1 (2) 3 4)
#+END_SRC
*** =paredit-forward-slurp-sexp=
And after we wrap the =2=, we type =*= and want to slurp in the =3=.
#+BEGIN_SRC emacs-lisp
(+ 1 (* |2) 3 4)
;; Keybinding C-)
(+ 1 (* 2 3) 4)
#+END_SRC
*** =paredit-forward-barf-sexp=
Oops, we slurped in the =4= by accident!  Let's unslurp it by barfing it out.
#+BEGIN_SRC emacs-lisp
(+ 1 (* 2 3 |4))
;; Keybinding C-}
(+ 1 (* 2 3) 4)
#+END_SRC


